extends Control

@onready var 图片_默认头盔: TextureRect = $控制节点_角色头盔槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备头盔: TextureRect = $控制节点_角色头盔槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认胸甲: TextureRect = $控制节点_角色胸甲槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备胸甲: TextureRect = $控制节点_角色胸甲槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认武器: TextureRect = $控制节点_角色武器槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备武器: TextureRect = $控制节点_角色武器槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认副手: TextureRect = $控制节点_角色副手槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备副手: TextureRect = $控制节点_角色副手槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认鞋子: TextureRect = $控制节点_角色鞋子槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备鞋子: TextureRect = $控制节点_角色鞋子槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认弹药: TextureRect = $控制节点_角色弹药槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备弹药: TextureRect = $控制节点_角色弹药槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位
@onready var 图片_默认饰品: TextureRect = $控制节点_角色饰品槽位/UI框架/边缘容器/图片_装备槽位背景/图片_默认装备槽位
@onready var 图片_已装备饰品: TextureRect = $控制节点_角色饰品槽位/UI框架/边缘容器/图片_装备槽位背景/图片_动态装备槽位

func _ready() -> void:
	_同步所有装备()
	动态仓库事件.connect("玩家装备物品",正在装备物品)
	动态仓库事件.connect("玩家卸载物品",正在卸载物品)
	
	

func _同步所有装备() -> void:
	_同步更新装备图标("头盔")
	_同步更新装备图标("胸甲")
	_同步更新装备图标("鞋子")
	_同步更新装备图标("武器")
	_同步更新装备图标("饰品")
	_同步更新装备图标("副手")
	_同步更新装备图标("弹药")
	

func _同步更新装备图标(物品属性后缀:String) -> void:
	var 处理物品:实体_物品 = 动态仓库数据.玩家数据.get("已装备_"+物品属性后缀)
	var 已装备物品属性 := "图片_已装备"+物品属性后缀
	var 默认图片 := "图片_默认"+物品属性后缀
	
	if 处理物品:
		get(已装备物品属性).set_texture(处理物品.物品图片)
	
	get(默认图片).set_visible(not 处理物品)
	get(已装备物品属性).set_visible(处理物品 != null)

func 正在装备物品(_物品) -> void:
	_同步所有装备()

func 正在卸载物品(_物品) -> void:
	_同步所有装备()
